OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
#define _DAC6CON0_NSS0          0x01
#define _DAC6CON0_DACNSS0       0x01
#define _DAC6CON0_DAC6NSS0      0x01
#define _DAC6CON0_NSS1          0x02
#define _DAC6CON0_DACNSS1       0x02
#define _DAC6CON0_DAC6NSS1      0x02
#define _DAC6CON0_PSS0          0x04
#define _DAC6CON0_DACPSS0       0x04
#define _DAC6CON0_DAC6PSS0      0x04
#define _DAC6CON0_PSS1          0x08
#define _DAC6CON0_DACPSS1       0x08
#define _DAC6CON0_DAC6PSS1      0x08
#define _DAC6CON0_OE2           0x10
#define _DAC6CON0_DACOE2        0x10
#define _DAC6CON0_DAC6OE2       0x10
#define _DAC6CON0_OE1           0x20
#define _DAC6CON0_OE            0x20
#define _DAC6CON0_DACOE1        0x20
#define _DAC6CON0_DACOE         0x20
#define _DAC6CON0_DAC6OE1       0x20
#define _DAC6CON0_FM            0x40
#define _DAC6CON0_DACFM         0x40
#define _DAC6CON0_DAC6FM        0x40
#define _DAC6CON0_EN            0x80
#define _DAC6CON0_DACEN         0x80
#define _DAC6CON0_DAC6EN        0x80

//==============================================================================


//==============================================================================
//        DAC6CON1 Bits

extern __at(0x059C) __sfr DAC6CON1;

typedef union
  {
  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned REF5               : 1;
    unsigned REF6               : 1;
    unsigned REF7               : 1;
    };

  struct
    {
    unsigned DAC6REF0           : 1;
    unsigned DAC6REF1           : 1;
    unsigned DAC6REF2           : 1;
    unsigned DAC6REF3           : 1;
    unsigned DAC6REF4           : 1;
    unsigned DAC6REF5           : 1;
    unsigned DAC6REF6           : 1;
    unsigned DAC6REF7           : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned R5                 : 1;
    unsigned R6                 : 1;
    unsigned R7                 : 1;
    };

  struct
    {
    unsigned DAC6R0             : 1;
    unsigned DAC6R1             : 1;
    unsigned DAC6R2             : 1;
    unsigned DAC6R3             : 1;
    unsigned DAC6R4             : 1;
    unsigned DAC6R5             : 1;
    unsigned DAC6R6             : 1;
    unsigned DAC6R7             : 1;
    };
  } __DAC6CON1bits_t;

extern __at(0x059C) volatile __DAC6CON1bits_t DAC6CON1bits;

#define _DAC6CON1_REF0          0x01
#define _DAC6CON1_DAC6REF0      0x01
#define _DAC6CON1_R0            0x01
#define _DAC6CON1_DAC6R0        0x01
#define _DAC6CON1_REF1          0x02
#define _DAC6CON1_DAC6REF1      0x02
#define _DAC6CON1_R1            0x02
#define _DAC6CON1_DAC6R1        0x02
#define _DAC6CON1_REF2          0x04
#define _DAC6CON1_DAC6REF2      0x04
#define _DAC6CON1_R2            0x04
#define _DAC6CON1_DAC6R2        0x04
#define _DAC6CON1_REF3          0x08
#define _DAC6CON1_DAC6REF3      0x08
#define _DAC6CON1_R3            0x08
#define _DAC6CON1_DAC6R3        0x08
#define _DAC6CON1_REF4          0x10
#define _DAC6CON1_DAC6REF4      0x10
#define _DAC6CON1_R4            0x10
#define _DAC6CON1_DAC6R4        0x10
#define _DAC6CON1_REF5          0x20
#define _DAC6CON1_DAC6REF5      0x20
#define _DAC6CON1_R5            0x20
#define _DAC6CON1_DAC6R5        0x20
#define _DAC6CON1_REF6          0x40
#define _DAC6CON1_DAC6REF6      0x40
#define _DAC6CON1_R6            0x40
#define _DAC6CON1_DAC6R6        0x40
#define _DAC6CON1_REF7          0x80
#define _DAC6CON1_DAC6REF7      0x80
#define _DAC6CON1_R7            0x80
#define _DAC6CON1_DAC6R7        0x80

//==============================================================================

extern __at(0x059C) __sfr DAC6REF;

//==============================================================================
//        DAC6REFL Bits

extern __at(0x059C) __sfr DAC6REFL;

typedef union
  {
  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned REF5               : 1;
    unsigned REF6               : 1;
    unsigned REF7               : 1;
    };

  struct
    {
    unsigned DAC6REF0           : 1;
    unsigned DAC6REF1           : 1;
    unsigned DAC6REF2           : 1;
    unsigned DAC6REF3           : 1;
    unsigned DAC6REF4           : 1;
    unsigned DAC6REF5           : 1;
    unsigned DAC6REF6           : 1;
    unsigned DAC6REF7           : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned R5                 : 1;
    unsigned R6                 : 1;
    unsigned R7                 : 1;
    };

  struct
    {
    unsigned DAC6R0             : 1;
    unsigned DAC6R1             : 1;
    unsigned DAC6R2             : 1;
    unsigned DAC6R3             : 1;
    unsigned DAC6R4             : 1;
    unsigned DAC6R5             : 1;
    unsigned DAC6R6             : 1;
    unsigned DAC6R7             : 1;
    };
  } __DAC6REFLbits_t;

extern __at(0x059C) volatile __DAC6REFLbits_t DAC6REFLbits;

#define _DAC6REFL_REF0          0x01
#define _DAC6REFL_DAC6REF0      0x01
#define _DAC6REFL_R0            0x01
#define _DAC6REFL_DAC6R0        0x01
#define _DAC6REFL_REF1          0x02
#define _DAC6REFL_DAC6REF1      0x02
#define _DAC6REFL_R1            0x02
#define _DAC6REFL_DAC6R1        0x02
#define _DAC6REFL_REF2          0x04
#define _DAC6REFL_DAC6REF2      0x04
#define _DAC6REFL_R2            0x04
#define _DAC6REFL_DAC6R2        0x04
#define _DAC6REFL_REF3          0x08
#define _DAC6REFL_DAC6REF3      0x08
#define _DAC6REFL_R3            0x08
#define _DAC6REFL_DAC6R3        0x08
#define _DAC6REFL_REF4          0x10
#define _DAC6REFL_DAC6REF4      0x10
#define _DAC6REFL_R4            0x10
#define _DAC6REFL_DAC6R4        0x10
#define _DAC6REFL_REF5          0x20
#define _DAC6REFL_DAC6REF5      0x20
#define _DAC6REFL_R5            0x20
#define _DAC6REFL_DAC6R5        0x20
#define _DAC6REFL_REF6          0x40
#define _DAC6REFL_DAC6REF6      0x40
#define _DAC6REFL_R6            0x40
#define _DAC6REFL_DAC6R6        0x40
#define _DAC6REFL_REF7          0x80
#define _DAC6REFL_DAC6REF7      0x80
#define _DAC6REFL_R7            0x80
#define _DAC6REFL_DAC6R7        0x80

//==============================================================================


//==============================================================================
//        DAC6CON2 Bits

extern __at(0x059D) __sfr DAC6CON2;

typedef union
  {
  struct
    {
    unsigned REF8               : 1;
    unsigned REF9               : 1;
    unsigned REF10              : 1;
    unsigned REF11              : 1;
    unsigned REF12              : 1;
    unsigned REF13              : 1;
    unsigned REF14              : 1;
    unsigned REF15              : 1;
    };

  struct
    {
    unsigned DAC6REF8           : 1;
    unsigned DAC6REF9           : 1;
    unsigned DAC6REF10          : 1;
    unsigned DAC6REF11          : 1;
    unsigned DAC6REF12          : 1;
    unsigned DAC6REF13          : 1;
    unsigned DAC6REF14          : 1;
    unsigned DAC6REF15          : 1;
    };

  struct
    {
    unsigned R8                 : 1;
    unsigned R9                 : 1;
    unsigned R10                : 1;
    unsigned R11                : 1;
    unsigned R12                : 1;
    unsigned R13                : 1;
    unsigned R14                : 1;
    unsigned R15                : 1;
    };

  struct
    {
    unsigned DAC6R8             : 1;
    unsigned DAC6R9             : 1;
    unsigned DAC6R10            : 1;
    unsigned DAC6R11            : 1;
    unsigned DAC6R12            : 1;
    unsigned DAC6R13            : 1;
    unsigned DAC6R14            : 1;
    unsigned DAC6R15            : 1;
    };
  } __DAC6CON2bits_t;

extern __at(0x059D) volatile __DAC6CON2bits_t DAC6CON2bits;

