OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
extern __at(0x060D) __sfr DAC8REF;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC8R0             : 1;
    unsigned DAC8R1             : 1;
    unsigned DAC8R2             : 1;
    unsigned DAC8R3             : 1;
    unsigned DAC8R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC8REF0           : 1;
    unsigned DAC8REF1           : 1;
    unsigned DAC8REF2           : 1;
    unsigned DAC8REF3           : 1;
    unsigned DAC8REF4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC8R              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned REF                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned R                  : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC8REF            : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };
  } __DAC8REFbits_t;

extern __at(0x060D) volatile __DAC8REFbits_t DAC8REFbits;

#define _DAC8REF_DACR0          0x01
#define _DAC8REF_R0             0x01
#define _DAC8REF_DAC8R0         0x01
#define _DAC8REF_REF0           0x01
#define _DAC8REF_DAC8REF0       0x01
#define _DAC8REF_DACR1          0x02
#define _DAC8REF_R1             0x02
#define _DAC8REF_DAC8R1         0x02
#define _DAC8REF_REF1           0x02
#define _DAC8REF_DAC8REF1       0x02
#define _DAC8REF_DACR2          0x04
#define _DAC8REF_R2             0x04
#define _DAC8REF_DAC8R2         0x04
#define _DAC8REF_REF2           0x04
#define _DAC8REF_DAC8REF2       0x04
#define _DAC8REF_DACR3          0x08
#define _DAC8REF_R3             0x08
#define _DAC8REF_DAC8R3         0x08
#define _DAC8REF_REF3           0x08
#define _DAC8REF_DAC8REF3       0x08
#define _DAC8REF_DACR4          0x10
#define _DAC8REF_R4             0x10
#define _DAC8REF_DAC8R4         0x10
#define _DAC8REF_REF4           0x10
#define _DAC8REF_DAC8REF4       0x10

//==============================================================================


//==============================================================================
//        PRG4RTSS Bits

extern __at(0x060E) __sfr PRG4RTSS;

typedef union
  {
  struct
    {
    unsigned RTSS0              : 1;
    unsigned RTSS1              : 1;
    unsigned RTSS2              : 1;
    unsigned RTSS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4RTSS0           : 1;
    unsigned RG4RTSS1           : 1;
    unsigned RG4RTSS2           : 1;
    unsigned RG4RTSS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4RTSS            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned RTSS               : 4;
    unsigned                    : 4;
    };
  } __PRG4RTSSbits_t;

extern __at(0x060E) volatile __PRG4RTSSbits_t PRG4RTSSbits;

#define _PRG4RTSS_RTSS0         0x01
#define _PRG4RTSS_RG4RTSS0      0x01
#define _PRG4RTSS_RTSS1         0x02
#define _PRG4RTSS_RG4RTSS1      0x02
#define _PRG4RTSS_RTSS2         0x04
#define _PRG4RTSS_RG4RTSS2      0x04
#define _PRG4RTSS_RTSS3         0x08
#define _PRG4RTSS_RG4RTSS3      0x08

//==============================================================================


//==============================================================================
//        PRG4FTSS Bits

extern __at(0x060F) __sfr PRG4FTSS;

typedef union
  {
  struct
    {
    unsigned FTSS0              : 1;
    unsigned FTSS1              : 1;
    unsigned FTSS2              : 1;
    unsigned FTSS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4FTSS0           : 1;
    unsigned RG4FTSS1           : 1;
    unsigned RG4FTSS2           : 1;
    unsigned RG4FTSS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4FTSS            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned FTSS               : 4;
    unsigned                    : 4;
    };
  } __PRG4FTSSbits_t;

extern __at(0x060F) volatile __PRG4FTSSbits_t PRG4FTSSbits;

#define _PRG4FTSS_FTSS0         0x01
#define _PRG4FTSS_RG4FTSS0      0x01
#define _PRG4FTSS_FTSS1         0x02
#define _PRG4FTSS_RG4FTSS1      0x02
#define _PRG4FTSS_FTSS2         0x04
#define _PRG4FTSS_RG4FTSS2      0x04
#define _PRG4FTSS_FTSS3         0x08
#define _PRG4FTSS_RG4FTSS3      0x08

//==============================================================================


//==============================================================================
//        PRG4INS Bits

extern __at(0x0610) __sfr PRG4INS;

typedef union
  {
  struct
    {
    unsigned INS0               : 1;
    unsigned INS1               : 1;
    unsigned INS2               : 1;
    unsigned INS3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4INS0            : 1;
    unsigned RG4INS1            : 1;
    unsigned RG4INS2            : 1;
    unsigned RG4INS3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned INS                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned RG4INS             : 4;
    unsigned                    : 4;
    };
  } __PRG4INSbits_t;

extern __at(0x0610) volatile __PRG4INSbits_t PRG4INSbits;

#define _PRG4INS_INS0           0x01
#define _PRG4INS_RG4INS0        0x01
#define _PRG4INS_INS1           0x02
#define _PRG4INS_RG4INS1        0x02
#define _PRG4INS_INS2           0x04
#define _PRG4INS_RG4INS2        0x04
#define _PRG4INS_INS3           0x08
#define _PRG4INS_RG4INS3        0x08

//==============================================================================


//==============================================================================
//        PRG4CON0 Bits

