OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
extern __at(0x0611) __sfr PRG4CON0;

typedef union
  {
  struct
    {
    unsigned GO                 : 1;
    unsigned OS                 : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned REDG               : 1;
    unsigned FEDG               : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned RG4GO              : 1;
    unsigned RG4OS              : 1;
    unsigned RG4MODE0           : 1;
    unsigned RG4MODE1           : 1;
    unsigned RG4REDG            : 1;
    unsigned RG4FEDG            : 1;
    unsigned                    : 1;
    unsigned RG4EN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned RG4MODE            : 2;
    unsigned                    : 4;
    };
  } __PRG4CON0bits_t;

extern __at(0x0611) volatile __PRG4CON0bits_t PRG4CON0bits;

#define _PRG4CON0_GO            0x01
#define _PRG4CON0_RG4GO         0x01
#define _PRG4CON0_OS            0x02
#define _PRG4CON0_RG4OS         0x02
#define _PRG4CON0_MODE0         0x04
#define _PRG4CON0_RG4MODE0      0x04
#define _PRG4CON0_MODE1         0x08
#define _PRG4CON0_RG4MODE1      0x08
#define _PRG4CON0_REDG          0x10
#define _PRG4CON0_RG4REDG       0x10
#define _PRG4CON0_FEDG          0x20
#define _PRG4CON0_RG4FEDG       0x20
#define _PRG4CON0_EN            0x80
#define _PRG4CON0_RG4EN         0x80

//==============================================================================


//==============================================================================
//        PRG4CON1 Bits

extern __at(0x0612) __sfr PRG4CON1;

typedef union
  {
  struct
    {
    unsigned RPOL               : 1;
    unsigned FPOL               : 1;
    unsigned RDY                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4RPOL            : 1;
    unsigned RG4FPOL            : 1;
    unsigned RG4RDY             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PRG4CON1bits_t;

extern __at(0x0612) volatile __PRG4CON1bits_t PRG4CON1bits;

#define _PRG4CON1_RPOL          0x01
#define _PRG4CON1_RG4RPOL       0x01
#define _PRG4CON1_FPOL          0x02
#define _PRG4CON1_RG4FPOL       0x02
#define _PRG4CON1_RDY           0x04
#define _PRG4CON1_RG4RDY        0x04

//==============================================================================


//==============================================================================
//        PRG4CON2 Bits

extern __at(0x0613) __sfr PRG4CON2;

typedef union
  {
  struct
    {
    unsigned ISET0              : 1;
    unsigned ISET1              : 1;
    unsigned ISET2              : 1;
    unsigned ISET3              : 1;
    unsigned ISET4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG4ISET0           : 1;
    unsigned RG4ISET1           : 1;
    unsigned RG4ISET2           : 1;
    unsigned RG4ISET3           : 1;
    unsigned RG4ISET4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ISET               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned RG4ISET            : 5;
    unsigned                    : 3;
    };
  } __PRG4CON2bits_t;

extern __at(0x0613) volatile __PRG4CON2bits_t PRG4CON2bits;

#define _PRG4CON2_ISET0         0x01
#define _PRG4CON2_RG4ISET0      0x01
#define _PRG4CON2_ISET1         0x02
#define _PRG4CON2_RG4ISET1      0x02
#define _PRG4CON2_ISET2         0x04
#define _PRG4CON2_RG4ISET2      0x04
#define _PRG4CON2_ISET3         0x08
#define _PRG4CON2_RG4ISET3      0x08
#define _PRG4CON2_ISET4         0x10
#define _PRG4CON2_RG4ISET4      0x10

//==============================================================================


//==============================================================================
//        PWM3DCL Bits

extern __at(0x0614) __sfr PWM3DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3DC0            : 1;
    unsigned PWM3DC1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWMPW0             : 1;
    unsigned PWMPW1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM3DC             : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWMPW              : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned DC                 : 2;
    };
  } __PWM3DCLbits_t;

extern __at(0x0614) volatile __PWM3DCLbits_t PWM3DCLbits;

#define _DC0                    0x40
#define _PWM3DC0                0x40
#define _PWMPW0                 0x40
#define _DC1                    0x80
#define _PWM3DC1                0x80
#define _PWMPW1                 0x80

//==============================================================================


//==============================================================================
//        PWM3DCH Bits

extern __at(0x0615) __sfr PWM3DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM3DC2            : 1;
    unsigned PWM3DC3            : 1;
    unsigned PWM3DC4            : 1;
    unsigned PWM3DC5            : 1;
    unsigned PWM3DC6            : 1;
    unsigned PWM3DC7            : 1;
    unsigned PWM3DC8            : 1;
    unsigned PWM3DC9            : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM3DCHbits_t;

extern __at(0x0615) volatile __PWM3DCHbits_t PWM3DCHbits;

