OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
extern __at(0x0895) volatile __COG4RIS0bits_t COG4RIS0bits;

#define _COG4RIS0_RIS0          0x01
#define _COG4RIS0_G4RIS0        0x01
#define _COG4RIS0_RIS1          0x02
#define _COG4RIS0_G4RIS1        0x02
#define _COG4RIS0_RIS2          0x04
#define _COG4RIS0_G4RIS2        0x04
#define _COG4RIS0_RIS3          0x08
#define _COG4RIS0_G4RIS3        0x08
#define _COG4RIS0_RIS4          0x10
#define _COG4RIS0_G4RIS4        0x10
#define _COG4RIS0_RIS5          0x20
#define _COG4RIS0_G4RIS5        0x20
#define _COG4RIS0_RIS6          0x40
#define _COG4RIS0_G4RIS6        0x40
#define _COG4RIS0_RIS7          0x80
#define _COG4RIS0_G4RIS7        0x80

//==============================================================================


//==============================================================================
//        COG4RIS1 Bits

extern __at(0x0896) __sfr COG4RIS1;

typedef union
  {
  struct
    {
    unsigned RIS8               : 1;
    unsigned RIS9               : 1;
    unsigned RIS10              : 1;
    unsigned RIS11              : 1;
    unsigned RIS12              : 1;
    unsigned RIS13              : 1;
    unsigned RIS14              : 1;
    unsigned RIS15              : 1;
    };

  struct
    {
    unsigned G4RIS8             : 1;
    unsigned G4RIS9             : 1;
    unsigned G4RIS10            : 1;
    unsigned G4RIS11            : 1;
    unsigned G4RIS12            : 1;
    unsigned G4RIS13            : 1;
    unsigned G4RIS14            : 1;
    unsigned G4RIS15            : 1;
    };
  } __COG4RIS1bits_t;

extern __at(0x0896) volatile __COG4RIS1bits_t COG4RIS1bits;

#define _COG4RIS1_RIS8          0x01
#define _COG4RIS1_G4RIS8        0x01
#define _COG4RIS1_RIS9          0x02
#define _COG4RIS1_G4RIS9        0x02
#define _COG4RIS1_RIS10         0x04
#define _COG4RIS1_G4RIS10       0x04
#define _COG4RIS1_RIS11         0x08
#define _COG4RIS1_G4RIS11       0x08
#define _COG4RIS1_RIS12         0x10
#define _COG4RIS1_G4RIS12       0x10
#define _COG4RIS1_RIS13         0x20
#define _COG4RIS1_G4RIS13       0x20
#define _COG4RIS1_RIS14         0x40
#define _COG4RIS1_G4RIS14       0x40
#define _COG4RIS1_RIS15         0x80
#define _COG4RIS1_G4RIS15       0x80

//==============================================================================


//==============================================================================
//        COG4RSIM0 Bits

extern __at(0x0897) __sfr COG4RSIM0;

typedef union
  {
  struct
    {
    unsigned RSIM0              : 1;
    unsigned RSIM1              : 1;
    unsigned RSIM2              : 1;
    unsigned RSIM3              : 1;
    unsigned RSIM4              : 1;
    unsigned RSIM5              : 1;
    unsigned RSIM6              : 1;
    unsigned RSIM7              : 1;
    };

  struct
    {
    unsigned G4RSIM0            : 1;
    unsigned G4RSIM1            : 1;
    unsigned G4RSIM2            : 1;
    unsigned G4RSIM3            : 1;
    unsigned G4RSIM4            : 1;
    unsigned G4RSIM5            : 1;
    unsigned G4RSIM6            : 1;
    unsigned G4RSIM7            : 1;
    };
  } __COG4RSIM0bits_t;

extern __at(0x0897) volatile __COG4RSIM0bits_t COG4RSIM0bits;

#define _COG4RSIM0_RSIM0        0x01
#define _COG4RSIM0_G4RSIM0      0x01
#define _COG4RSIM0_RSIM1        0x02
#define _COG4RSIM0_G4RSIM1      0x02
#define _COG4RSIM0_RSIM2        0x04
#define _COG4RSIM0_G4RSIM2      0x04
#define _COG4RSIM0_RSIM3        0x08
#define _COG4RSIM0_G4RSIM3      0x08
#define _COG4RSIM0_RSIM4        0x10
#define _COG4RSIM0_G4RSIM4      0x10
#define _COG4RSIM0_RSIM5        0x20
#define _COG4RSIM0_G4RSIM5      0x20
#define _COG4RSIM0_RSIM6        0x40
#define _COG4RSIM0_G4RSIM6      0x40
#define _COG4RSIM0_RSIM7        0x80
#define _COG4RSIM0_G4RSIM7      0x80

//==============================================================================


//==============================================================================
//        COG4RSIM1 Bits

extern __at(0x0898) __sfr COG4RSIM1;

typedef union
  {
  struct
    {
    unsigned RSIM8              : 1;
    unsigned RSIM9              : 1;
    unsigned RSIM10             : 1;
    unsigned RSIM11             : 1;
    unsigned RSIM12             : 1;
    unsigned RSIM13             : 1;
    unsigned RSIM14             : 1;
    unsigned RSIM15             : 1;
    };

  struct
    {
    unsigned G4RSIM8            : 1;
    unsigned G4RSIM9            : 1;
    unsigned G4RSIM10           : 1;
    unsigned G4RSIM11           : 1;
    unsigned G4RSIM12           : 1;
    unsigned G4RSIM13           : 1;
    unsigned G4RSIM14           : 1;
    unsigned G4RSIM15           : 1;
    };
  } __COG4RSIM1bits_t;

extern __at(0x0898) volatile __COG4RSIM1bits_t COG4RSIM1bits;

#define _COG4RSIM1_RSIM8        0x01
#define _COG4RSIM1_G4RSIM8      0x01
#define _COG4RSIM1_RSIM9        0x02
#define _COG4RSIM1_G4RSIM9      0x02
#define _COG4RSIM1_RSIM10       0x04
#define _COG4RSIM1_G4RSIM10     0x04
#define _COG4RSIM1_RSIM11       0x08
#define _COG4RSIM1_G4RSIM11     0x08
#define _COG4RSIM1_RSIM12       0x10
#define _COG4RSIM1_G4RSIM12     0x10
#define _COG4RSIM1_RSIM13       0x20
#define _COG4RSIM1_G4RSIM13     0x20
#define _COG4RSIM1_RSIM14       0x40
#define _COG4RSIM1_G4RSIM14     0x40
#define _COG4RSIM1_RSIM15       0x80
#define _COG4RSIM1_G4RSIM15     0x80

//==============================================================================


//==============================================================================
//        COG4FIS0 Bits

extern __at(0x0899) __sfr COG4FIS0;

typedef union
  {
  struct
    {
    unsigned FIS0               : 1;
    unsigned FIS1               : 1;
    unsigned FIS2               : 1;
    unsigned FIS3               : 1;
    unsigned FIS4               : 1;
    unsigned FIS5               : 1;
    unsigned FIS6               : 1;
    unsigned FIS7               : 1;
    };

  struct
    {
    unsigned G4FIS0             : 1;
    unsigned G4FIS1             : 1;
    unsigned G4FIS2             : 1;
    unsigned G4FIS3             : 1;
    unsigned G4FIS4             : 1;
    unsigned G4FIS5             : 1;
    unsigned G4FIS6             : 1;
    unsigned G4FIS7             : 1;
    };
  } __COG4FIS0bits_t;

extern __at(0x0899) volatile __COG4FIS0bits_t COG4FIS0bits;

#define _COG4FIS0_FIS0          0x01
#define _COG4FIS0_G4FIS0        0x01
#define _COG4FIS0_FIS1          0x02
#define _COG4FIS0_G4FIS1        0x02
#define _COG4FIS0_FIS2          0x04
#define _COG4FIS0_G4FIS2        0x04
#define _COG4FIS0_FIS3          0x08
#define _COG4FIS0_G4FIS3        0x08
#define _COG4FIS0_FIS4          0x10
#define _COG4FIS0_G4FIS4        0x10
#define _COG4FIS0_FIS5          0x20
#define _COG4FIS0_G4FIS5        0x20
#define _COG4FIS0_FIS6          0x40
#define _COG4FIS0_G4FIS6        0x40
#define _COG4FIS0_FIS7          0x80
#define _COG4FIS0_G4FIS7        0x80

//==============================================================================


//==============================================================================
//        COG4FIS1 Bits

extern __at(0x089A) __sfr COG4FIS1;

typedef union
  {
  struct
    {
    unsigned FIS8               : 1;
    unsigned FIS9               : 1;
    unsigned FIS10              : 1;
    unsigned FIS11              : 1;
    unsigned FIS12              : 1;
    unsigned FIS13              : 1;
    unsigned FIS14              : 1;
    unsigned FIS15              : 1;
    };

  struct
    {
    unsigned G4FIS8             : 1;
    unsigned G4FIS9             : 1;
    unsigned G4FIS10            : 1;
    unsigned G4FIS11            : 1;
    unsigned G4FIS12            : 1;
    unsigned G4FIS13            : 1;
    unsigned G4FIS14            : 1;
    unsigned G4FIS15            : 1;
    };
  } __COG4FIS1bits_t;

extern __at(0x089A) volatile __COG4FIS1bits_t COG4FIS1bits;

#define _COG4FIS1_FIS8          0x01
#define _COG4FIS1_G4FIS8        0x01
#define _COG4FIS1_FIS9          0x02
#define _COG4FIS1_G4FIS9        0x02
#define _COG4FIS1_FIS10         0x04
#define _COG4FIS1_G4FIS10       0x04
#define _COG4FIS1_FIS11         0x08
#define _COG4FIS1_G4FIS11       0x08
#define _COG4FIS1_FIS12         0x10
#define _COG4FIS1_G4FIS12       0x10
#define _COG4FIS1_FIS13         0x20
#define _COG4FIS1_G4FIS13       0x20
#define _COG4FIS1_FIS14         0x40
#define _COG4FIS1_G4FIS14       0x40
#define _COG4FIS1_FIS15         0x80
#define _COG4FIS1_G4FIS15       0x80

//==============================================================================


//==============================================================================
//        COG4FSIM0 Bits

