OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
extern __at(0x091C) volatile __CM8CON0bits_t CM8CON0bits;

#define _CM8CON0_SYNC           0x01
#define _CM8CON0_C8SYNC         0x01
#define _CM8CON0_HYS            0x02
#define _CM8CON0_C8HYS          0x02
#define _CM8CON0_Reserved       0x04
#define _CM8CON0_C8SP           0x04
#define _CM8CON0_ZLF            0x08
#define _CM8CON0_C8ZLF          0x08
#define _CM8CON0_POL            0x10
#define _CM8CON0_C8POL          0x10
#define _CM8CON0_OUT            0x40
#define _CM8CON0_C8OUT          0x40
#define _CM8CON0_ON             0x80
#define _CM8CON0_C8ON           0x80

//==============================================================================


//==============================================================================
//        CM8CON1 Bits

extern __at(0x091D) __sfr CM8CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C8INTN             : 1;
    unsigned C8INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM8CON1bits_t;

extern __at(0x091D) volatile __CM8CON1bits_t CM8CON1bits;

#define _CM8CON1_INTN           0x01
#define _CM8CON1_C8INTN         0x01
#define _CM8CON1_INTP           0x02
#define _CM8CON1_C8INTP         0x02

//==============================================================================


//==============================================================================
//        CM8NSEL Bits

extern __at(0x091E) __sfr CM8NSEL;

typedef union
  {
  struct
    {
    unsigned C8NCH0             : 1;
    unsigned C8NCH1             : 1;
    unsigned C8NCH2             : 1;
    unsigned C8NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C8NCH              : 4;
    unsigned                    : 4;
    };
  } __CM8NSELbits_t;

extern __at(0x091E) volatile __CM8NSELbits_t CM8NSELbits;

#define _C8NCH0                 0x01
#define _C8NCH1                 0x02
#define _C8NCH2                 0x04
#define _C8NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM8PSEL Bits

extern __at(0x091F) __sfr CM8PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C8PCH0             : 1;
    unsigned C8PCH1             : 1;
    unsigned C8PCH2             : 1;
    unsigned C8PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned C8PCH              : 4;
    unsigned                    : 4;
    };
  } __CM8PSELbits_t;

extern __at(0x091F) volatile __CM8PSELbits_t CM8PSELbits;

#define _CM8PSEL_PCH0           0x01
#define _CM8PSEL_C8PCH0         0x01
#define _CM8PSEL_PCH1           0x02
#define _CM8PSEL_C8PCH1         0x02
#define _CM8PSEL_PCH2           0x04
#define _CM8PSEL_C8PCH2         0x04
#define _CM8PSEL_PCH3           0x08
#define _CM8PSEL_C8PCH3         0x08

//==============================================================================


//==============================================================================
//        MD4CON0 Bits

extern __at(0x0D1B) __sfr MD4CON0;

typedef union
  {
  struct
    {
    unsigned BIT                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPOL               : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned MD4BIT             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MD4OPOL            : 1;
    unsigned MD4OUT             : 1;
    unsigned                    : 1;
    unsigned MD4EN              : 1;
    };
  } __MD4CON0bits_t;

extern __at(0x0D1B) volatile __MD4CON0bits_t MD4CON0bits;

#define _MD4CON0_BIT            0x01
#define _MD4CON0_MD4BIT         0x01
#define _MD4CON0_OPOL           0x10
#define _MD4CON0_MD4OPOL        0x10
#define _MD4CON0_OUT            0x20
#define _MD4CON0_MD4OUT         0x20
#define _MD4CON0_EN             0x80
#define _MD4CON0_MD4EN          0x80

//==============================================================================


//==============================================================================
//        MD4CON1 Bits

extern __at(0x0D1C) __sfr MD4CON1;

typedef union
  {
  struct
    {
    unsigned CLSYNC             : 1;
    unsigned CLPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CHSYNC             : 1;
    unsigned CHPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD4CLSYNC          : 1;
    unsigned MD4CLPOL           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MD4CHSYNC          : 1;
    unsigned MD4CHPOL           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __MD4CON1bits_t;

extern __at(0x0D1C) volatile __MD4CON1bits_t MD4CON1bits;

