OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1779.h
extern __at(0x0DC5) __sfr PWM12PR;

//==============================================================================
//        PWM12PRL Bits

extern __at(0x0DC5) __sfr PWM12PRL;

typedef struct
  {
  unsigned PWM12PRL0            : 1;
  unsigned PWM12PRL1            : 1;
  unsigned PWM12PRL2            : 1;
  unsigned PWM12PRL3            : 1;
  unsigned PWM12PRL4            : 1;
  unsigned PWM12PRL5            : 1;
  unsigned PWM12PRL6            : 1;
  unsigned PWM12PRL7            : 1;
  } __PWM12PRLbits_t;

extern __at(0x0DC5) volatile __PWM12PRLbits_t PWM12PRLbits;

#define _PWM12PRL0              0x01
#define _PWM12PRL1              0x02
#define _PWM12PRL2              0x04
#define _PWM12PRL3              0x08
#define _PWM12PRL4              0x10
#define _PWM12PRL5              0x20
#define _PWM12PRL6              0x40
#define _PWM12PRL7              0x80

//==============================================================================


//==============================================================================
//        PWM12PRH Bits

extern __at(0x0DC6) __sfr PWM12PRH;

typedef struct
  {
  unsigned PWM12PRH0            : 1;
  unsigned PWM12PRH1            : 1;
  unsigned PWM12PRH2            : 1;
  unsigned PWM12PRH3            : 1;
  unsigned PWM12PRH4            : 1;
  unsigned PWM12PRH5            : 1;
  unsigned PWM12PRH6            : 1;
  unsigned PWM12PRH7            : 1;
  } __PWM12PRHbits_t;

extern __at(0x0DC6) volatile __PWM12PRHbits_t PWM12PRHbits;

#define _PWM12PRH0              0x01
#define _PWM12PRH1              0x02
#define _PWM12PRH2              0x04
#define _PWM12PRH3              0x08
#define _PWM12PRH4              0x10
#define _PWM12PRH5              0x20
#define _PWM12PRH6              0x40
#define _PWM12PRH7              0x80

//==============================================================================

extern __at(0x0DC7) __sfr PWM12OF;

//==============================================================================
//        PWM12OFL Bits

extern __at(0x0DC7) __sfr PWM12OFL;

typedef struct
  {
  unsigned PWM12OFL0            : 1;
  unsigned PWM12OFL1            : 1;
  unsigned PWM12OFL2            : 1;
  unsigned PWM12OFL3            : 1;
  unsigned PWM12OFL4            : 1;
  unsigned PWM12OFL5            : 1;
  unsigned PWM12OFL6            : 1;
  unsigned PWM12OFL7            : 1;
  } __PWM12OFLbits_t;

extern __at(0x0DC7) volatile __PWM12OFLbits_t PWM12OFLbits;

#define _PWM12OFL0              0x01
#define _PWM12OFL1              0x02
#define _PWM12OFL2              0x04
#define _PWM12OFL3              0x08
#define _PWM12OFL4              0x10
#define _PWM12OFL5              0x20
#define _PWM12OFL6              0x40
#define _PWM12OFL7              0x80

//==============================================================================


//==============================================================================
//        PWM12OFH Bits

extern __at(0x0DC8) __sfr PWM12OFH;

typedef struct
  {
  unsigned PWM12OFH0            : 1;
  unsigned PWM12OFH1            : 1;
  unsigned PWM12OFH2            : 1;
  unsigned PWM12OFH3            : 1;
  unsigned PWM12OFH4            : 1;
  unsigned PWM12OFH5            : 1;
  unsigned PWM12OFH6            : 1;
  unsigned PWM12OFH7            : 1;
  } __PWM12OFHbits_t;

extern __at(0x0DC8) volatile __PWM12OFHbits_t PWM12OFHbits;

#define _PWM12OFH0              0x01
#define _PWM12OFH1              0x02
#define _PWM12OFH2              0x04
#define _PWM12OFH3              0x08
#define _PWM12OFH4              0x10
#define _PWM12OFH5              0x20
#define _PWM12OFH6              0x40
#define _PWM12OFH7              0x80

//==============================================================================

extern __at(0x0DC9) __sfr PWM12TMR;

//==============================================================================
//        PWM12TMRL Bits

extern __at(0x0DC9) __sfr PWM12TMRL;

typedef struct
  {
  unsigned PWM12TMRL0           : 1;
  unsigned PWM12TMRL1           : 1;
  unsigned PWM12TMRL2           : 1;
  unsigned PWM12TMRL3           : 1;
  unsigned PWM12TMRL4           : 1;
  unsigned PWM12TMRL5           : 1;
  unsigned PWM12TMRL6           : 1;
  unsigned PWM12TMRL7           : 1;
  } __PWM12TMRLbits_t;

extern __at(0x0DC9) volatile __PWM12TMRLbits_t PWM12TMRLbits;

#define _PWM12TMRL0             0x01
#define _PWM12TMRL1             0x02
#define _PWM12TMRL2             0x04
#define _PWM12TMRL3             0x08
#define _PWM12TMRL4             0x10
#define _PWM12TMRL5             0x20
#define _PWM12TMRL6             0x40
#define _PWM12TMRL7             0x80

//==============================================================================


//==============================================================================
//        PWM12TMRH Bits

extern __at(0x0DCA) __sfr PWM12TMRH;

typedef struct
  {
  unsigned PWM12TMRH0           : 1;
  unsigned PWM12TMRH1           : 1;
  unsigned PWM12TMRH2           : 1;
  unsigned PWM12TMRH3           : 1;
  unsigned PWM12TMRH4           : 1;
  unsigned PWM12TMRH5           : 1;
  unsigned PWM12TMRH6           : 1;
  unsigned PWM12TMRH7           : 1;
  } __PWM12TMRHbits_t;

extern __at(0x0DCA) volatile __PWM12TMRHbits_t PWM12TMRHbits;

#define _PWM12TMRH0             0x01
#define _PWM12TMRH1             0x02
#define _PWM12TMRH2             0x04
#define _PWM12TMRH3             0x08
#define _PWM12TMRH4             0x10
#define _PWM12TMRH5             0x20
#define _PWM12TMRH6             0x40
#define _PWM12TMRH7             0x80

//==============================================================================


//==============================================================================
//        PWM12CON Bits

extern __at(0x0DCB) __sfr PWM12CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM12MODE0         : 1;
    unsigned PWM12MODE1         : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM12POL           : 1;
    unsigned PWM12OUT           : 1;
    unsigned                    : 1;
    unsigned PWM12EN            : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM12MODE          : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };
  } __PWM12CONbits_t;

extern __at(0x0DCB) volatile __PWM12CONbits_t PWM12CONbits;

#define _PWM12CON_PWM12MODE0    0x04
#define _PWM12CON_MODE0         0x04
#define _PWM12CON_PWM12MODE1    0x08
#define _PWM12CON_MODE1         0x08
#define _PWM12CON_POL           0x10
#define _PWM12CON_PWM12POL      0x10
#define _PWM12CON_OUT           0x20
#define _PWM12CON_PWM12OUT      0x20
#define _PWM12CON_EN            0x80
#define _PWM12CON_PWM12EN       0x80

//==============================================================================


//==============================================================================
//        PWM12INTCON Bits

extern __at(0x0DCC) __sfr PWM12INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM12PRIE          : 1;
    unsigned PWM12DCIE          : 1;
    unsigned PWM12PHIE          : 1;
    unsigned PWM12OFIE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM12INTCONbits_t;

extern __at(0x0DCC) volatile __PWM12INTCONbits_t PWM12INTCONbits;

#define _PWM12INTCON_PRIE       0x01
#define _PWM12INTCON_PWM12PRIE  0x01
#define _PWM12INTCON_DCIE       0x02
#define _PWM12INTCON_PWM12DCIE  0x02
#define _PWM12INTCON_PHIE       0x04
#define _PWM12INTCON_PWM12PHIE  0x04
#define _PWM12INTCON_OFIE       0x08
#define _PWM12INTCON_PWM12OFIE  0x08

//==============================================================================


//==============================================================================
//        PWM12INTE Bits

extern __at(0x0DCC) __sfr PWM12INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM12PRIE          : 1;
    unsigned PWM12DCIE          : 1;
    unsigned PWM12PHIE          : 1;
    unsigned PWM12OFIE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM12INTEbits_t;

extern __at(0x0DCC) volatile __PWM12INTEbits_t PWM12INTEbits;

#define _PWM12INTE_PRIE         0x01
#define _PWM12INTE_PWM12PRIE    0x01
#define _PWM12INTE_DCIE         0x02
#define _PWM12INTE_PWM12DCIE    0x02
#define _PWM12INTE_PHIE         0x04
#define _PWM12INTE_PWM12PHIE    0x04
#define _PWM12INTE_OFIE         0x08
#define _PWM12INTE_PWM12OFIE    0x08

//==============================================================================


//==============================================================================
//        PWM12INTF Bits

extern __at(0x0DCD) __sfr PWM12INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM12PRIF          : 1;
    unsigned PWM12DCIF          : 1;
    unsigned PWM12PHIF          : 1;
    unsigned PWM12OFIF          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM12INTFbits_t;

extern __at(0x0DCD) volatile __PWM12INTFbits_t PWM12INTFbits;

